// Підключаємо роутер до бек-енду
const express = require('express')
const router = express.Router()

// Підключіть файли роутів
// Підключіть інші файли роутів, якщо є
// Об'єднайте файли роутів за потреби
//===================================================================================================

router.get('/second-page', function (req, res) {
  // res.render генерує нам HTML сторінку

  // ↙️ cюди вводимо назву файлу з сontainer
  res.render('second-page', {
    // вказуємо назву контейнера
    name: 'second-page',
    // вказуємо назву компонентів
    component: ['heading'],

    // вказуємо назву сторінки
    title: 'Друга сторінка',
    // ... сюди можна далі продовжувати додавати потрібні технічні дані, які будуть використовуватися в layout

    // вказуємо дані,
    data: {
      // test: new Test().test,
    },
  })
  // ↑↑ сюди вводимо JSON дані
})
// Використовуйте інші файли роутів, якщо є

// Експортуємо глобальний роутер
module.exports = router
